## Production: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_base_path_mapping.api will be created
  + resource "aws_api_gateway_base_path_mapping" "api" {
      + api_id      = "71oj6jax35"
      + domain_name = "api-lambda.notification.canada.ca"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # aws_api_gateway_domain_name.api will be created
  + resource "aws_api_gateway_domain_name" "api" {
      + arn                      = (known after apply)
      + certificate_upload_date  = (known after apply)
      + cloudfront_domain_name   = (known after apply)
      + cloudfront_zone_id       = (known after apply)
      + domain_name              = "api-lambda.notification.canada.ca"
      + id                       = (known after apply)
      + regional_certificate_arn = "arn:aws:acm:ca-central-1:296255494825:certificate/562e7b2c-c913-4fbd-bfd5-d2f58d3c09dc"
      + regional_domain_name     = (known after apply)
      + regional_zone_id         = (known after apply)
      + security_policy          = "TLS_1_2"
      + tags_all                 = (known after apply)

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>